app/views/freights/_form.html.erb

  <strong>Caminhão </strong> <br>
  <%= collection_select(:freight, :truck_id, Truck.all, :id,:plate, {required: true,value:nil, selected: @freight.truck_id})%>
---
SELECT "trucks".* FROM "trucks"