app/views/freights/index.html.erb

    <%= f.label :caminhao%>
    <%= collection_select(:freight, :truck_id, Truck.all, :id,:plate, {prompt:true, value:nil, selected: nil})%>
---
SELECT "freights".* FROM "freights"
SELECT "trucks".* FROM "trucks"