app/views/freights/new.html.erb

SELECT "trucks".* FROM "trucks"
---
  <strong>Caminhão </strong> <br>
  <%= collection_select(:freight, :truck_id, Truck.all, :id,:plate, {required: true,value:nil, selected: nil})%>