app/controllers/freights_controller.rb

  def index
    @freights = Freight.all.sort_by { |freight| [freight.truck.plate, freight.date_freight] }
---
SELECT  "freights".* FROM "freights" WHERE "freights"."truck_id" = ? LIMIT ?  [["truck_id", nil], ["LIMIT", 1]]
SELECT  "trucks".* FROM "trucks" WHERE "trucks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @freight.destroy
---
DELETE FROM "freights" WHERE "freights"."id" = ?  [["id", 1]]

  def update
    if @freight.update(freight_params)
---
UPDATE "freights" SET "value_left" = ?, "value_freight" = ?, "source_freight" = ?, "destiny_freight" = ?, "updated_at" = ? WHERE "freights"."id" = ?  [["value_left", 34534.0], ["value_freight", 32453.0], ["source_freight", "gfhgdf"], ["destiny_freight", "sdfghdfh"], ["updated_at", "2018-05-21 18:18:13.058985"], ["id", 1]]

  def create
    @freight = Freight.new(freight_params)
    if @freight.save
---
INSERT INTO "freights" ("value_left", "date_freight", "source_freight", "destiny_freight", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["value_left", 0.0], ["date_freight", "as"], ["source_freight", "asd"], ["destiny_freight", "ad"], ["created_at", "2018-05-16 18:20:14.640771"], ["updated_at", "2018-05-16 18:20:14.640771"]]

    def set_freight
      @freight = Freight.find(params[:id])
---
SELECT  "freights".* FROM "freights" WHERE "freights"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]