app/controllers/trucks_controller.rb

  def index
    @trucks = Truck.all
---
SELECT "trucks".* FROM "trucks"

  def create
    @truck = Truck.new(truck_params)

    respond_to do |format|
      if @truck.save
---
INSERT INTO "trucks" ("plate", "mark", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["plate", "AZL-8763"], ["mark", "VOLVO"], ["created_at", "2018-05-21 17:50:53.086162"], ["updated_at", "2018-05-21 17:50:53.086162"]]

    def set_truck
      @truck = Truck.find(params[:id])
---
SELECT  "trucks".* FROM "trucks" WHERE "trucks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]